Sequential(
  (0): Conv2d(1, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
  (1): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (2): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (3): DownSampleBlock(
    (conv): Conv2d(128, 128, kernel_size=(3, 3), stride=(2, 2))
  )
  (4): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (5): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (6): DownSampleBlock(
    (conv): Conv2d(128, 128, kernel_size=(3, 3), stride=(2, 2))
  )
  (7): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 128, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
    (channel_up): Conv2d(128, 256, kernel_size=(1, 1), stride=(1, 1))
  )
  (8): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (9): DownSampleBlock(
    (conv): Conv2d(256, 256, kernel_size=(3, 3), stride=(2, 2))
  )
  (10): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (11): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (12): DownSampleBlock(
    (conv): Conv2d(256, 256, kernel_size=(3, 3), stride=(2, 2))
  )
  (13): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 256, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(256, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
    (channel_up): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
  )
  (14): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (15): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (16): NonLocalBlock(
    (gn): GroupNorm(
      (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
    )
    (q): Conv2d(512, 512, kernel_size=(1, 1), stride=(1, 1))
    (k): Conv2d(512, 512, kernel_size=(1, 1), stride=(1, 1))
    (v): Conv2d(512, 512, kernel_size=(1, 1), stride=(1, 1))
    (proj_out): Conv2d(512, 512, kernel_size=(1, 1), stride=(1, 1))
  )
  (17): ResidualBlock(
    (block): Sequential(
      (0): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (1): Swish()
      (2): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      (3): GroupNorm(
        (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
      )
      (4): Swish()
      (5): Conv2d(512, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (18): GroupNorm(
    (gn): GroupNorm(32, 512, eps=1e-06, affine=True)
  )
  (19): Swish()
  (20): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
)